In [2]:
import pandas as pd
import pyodbc

server = 'DESKTOP-1Q56108' # Nome do servidor SQL Server
database = 'Python'        # Nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 18 for SQL Server};'f'SERVER={server};'f'DATABASE={database};''Trusted_Connection=yes;')
cursor = conexaoDB.cursor() # criando o cursor de comando para executar as consultas (queries)

In [3]:
Produtos = pd.read_excel(r'C:\Users\Cliente\Desktop\Engenharia_de_dados_com_Python\SGBDS_PYTHON\4_ETL Pandas\arquivos_excel\Produto.xlsx')
Categoria = pd.read_excel(r'C:\Users\Cliente\Desktop\Engenharia_de_dados_com_Python\SGBDS_PYTHON\4_ETL Pandas\arquivos_excel\Categoria.xlsx')
Itens = pd.read_excel(r'C:\Users\Cliente\Desktop\Engenharia_de_dados_com_Python\SGBDS_PYTHON\4_ETL Pandas\arquivos_excel\items.xlsx')
Ordens = pd.read_excel(r'C:\Users\Cliente\Desktop\Engenharia_de_dados_com_Python\SGBDS_PYTHON\4_ETL Pandas\arquivos_excel\Ordens.xlsx')
Clientes = pd.read_csv(r'C:\Users\Cliente\Desktop\Engenharia_de_dados_com_Python\SGBDS_PYTHON\4_ETL Pandas\arquivos_csv\Clientes.csv', delimiter=',')

In [6]:
Ordens.head(1)

   id          created_at  customer_id    status
0   0 2019-08-28 03:36:31           91  entregue

In [7]:
Clientes.head(1)

,id,created_at,first_name,last_name,email,cell_phone,country,state,street,number,additionals
0,0,2017-11-01 14:45:41,Marta,Jesus,NaN,9 9102-7834,Brasil,Acre,NaN,NaN,Conjunto 16

In [4]:
T1 = pd.merge(Ordens, Clientes, left_on="customer_id", right_on="id", how="left")

# Left join -> faz um join entre a tabela da esquerda e a tabela da direita conservando todos os dados da tabela da esquerda
# Right join -> faz um join entre a tabela da esquerda e a tabela da direita conservando todos os dados da tabela da direita
# Inner -> retorna os dados apenas quando as duas tabelas tem chaves correspondentes
# Outer -> retorna todos os registros das duas tabelas

In [11]:
T1.head(1)

,id_x,created_at_x,customer_id,status,id_y,created_at_y,first_name,last_name,email,cell_phone,country,state,street,number,additionals
0,0,2019-08-28 03:36:31,91,entregue,91,2018-09-12 22:12:05,Daniel,Costa,daniel@teste.com,9 4761-6557,Brasil,Rio Grande do Norte,Praça 25 do Estado Rio Grande do Norte,281.0,Apto 8

In [5]:
T1 = T1[["id_x", "created_at_x", "first_name", "cell_phone", "state"]]
T1.head(1)

   id_x        created_at_x first_name   cell_phone                state
0     0 2019-08-28 03:36:31     Daniel  9 4761-6557  Rio Grande do Norte

In [6]:
T2 = pd.merge(Itens, Produtos, left_on="product_id", right_on="ID", how="left")
T2.head(1)

,id,order_id,product_id,quantity,total_price,ID,Name,Price,Id_Category
0,0,7019,28,1,186,28,Impressora,186,5

In [8]:
# Escolhi só as colunas que me importam
T2 = T2[["id", "Name", "Id_Category"]]
T2.head(3)

   id        Name  Id_Category
0   0  Impressora            5
1   1  HD Externo            5
2   2          PC            7

In [9]:
categoria_prod = pd.merge(T2, Categoria, left_on="Id_Category", right_on="id", how="left")
categoria_prod.head(5)

   id_x        Name  Id_Category  id_y         nome
0     0  Impressora            5     5  Informática
1     1  HD Externo            5     5  Informática
2     2          PC            7     7  Eletrônicos
3     3    Notebook            7     7  Eletrônicos
4     4  Impressora            5     5  Informática

In [10]:
categoria_prod = categoria_prod[["id_x", "Name", "Id_Category", "nome"]]
categoria_prod.head(5)

   id_x        Name  Id_Category         nome
0     0  Impressora            5  Informática
1     1  HD Externo            5  Informática
2     2          PC            7  Eletrônicos
3     3    Notebook            7  Eletrônicos
4     4  Impressora            5  Informática